rammp-org/pace-hmi-fw/sdkconfig.defaults
# TODO: uncomment one of these if you want to support a specifc target by default
# CONFIG_IDF_TARGET="esp32"
# CONFIG_IDF_TARGET="esp32s2"
# CONFIG_IDF_TARGET="esp32s3"
# CONFIG_IDF_TARGET="esp32c3"
# CONFIG_IDF_TARGET="esp32c6"
# CONFIG_IDF_TARGET="esp32h2"
CONFIG_IDF_TARGET="esp32p4"

# This board's ESP32-P4 is silicon revision v1.3. Rev <3.0 and >=3.0 support is
# mutually exclusive in ESP-IDF; the default (v3.1+) refuses to flash this chip.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
# Rev <3.0 silicon runs the CPU from a 360MHz CPLL; 400MHz (the v3.x default)
# fails the esp_clk_init assert at boot.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# 16MB flash with a custom partition table (8M app + 4M storage)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM — required for the MIPI DSI frame buffer (matches the m5stack-tab5
# BSP example's config)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Compile at -O2: LVGL renders transition frames in software on the CPU, and
# debug optimization (-Og, the IDF default) makes full-screen redraws several
# times slower.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# W5500 SPI Ethernet on the M5-Bus header (SCK=GPIO5, MOSI=GPIO18,
# MISO=GPIO19, CS=GPIO45, INT=GPIO52) — network transport for RTPS. The W5500
# chip driver itself comes from the espressif/w5500 managed component (in IDF
# 6.0 the SPI-Ethernet chip drivers moved out of esp_eth to the registry).
CONFIG_ETH_USE_SPI_ETHERNET=y

# Font sizes referenced by the SquareLine UI export (main/ui/screens). Any size
# used there must be enabled here or the build fails on an undeclared
# lv_font_montserrat_<N>.
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Task stack sizes and tick rate from the m5stack-tab5 BSP example — the
# default 3.5K main stack overflows during LVGL/audio/ADC setup.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000

# TODO: uncomment if you want freertos to run at 1 khz instead of the default 100 hz
# CONFIG_FREERTOS_HZ=1000

# TODO: uncomment if you want to run the esp at max clock speed (240 mhz)
# ESP32-specific
#
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# TODO: uncomment if you want to update the event and main task stask sizes
# Common ESP-related
#
# CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
# CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# SVG rendering for the SquareLine image assets exported as raw SVG data
# (main/ui/images/ui_img_*.c hold the .svg text verbatim). LVGL's SVG image
# decoder is compiled out unless LV_USE_SVG is set, and LV_USE_SVG depends on
# LV_USE_VECTOR_GRAPHIC. Vector drawing itself has no software fallback — the
# SW draw unit's vector path is guarded on LV_USE_VECTOR_GRAPHIC && LV_USE_THORVG
# — so ThorVG must be built in too, or SVG images render as blank rectangles.
CONFIG_LV_USE_VECTOR_GRAPHIC=y
CONFIG_LV_USE_THORVG=y
CONFIG_LV_USE_THORVG_INTERNAL=y
CONFIG_LV_USE_SVG=y

# --- Rendering performance (step 1) ---
# The refresh timer is already forced to 16 ms at runtime in main.cpp; match the
# compiled-in default so the two cannot disagree.
CONFIG_LV_DEF_REFR_PERIOD=16
#
# NOT re-enabling the image cache. Measured: 176.0 -> 175.5 ms (~1%), because the
# cost is ThorVG RASTERIZING the vectors, not parsing them -- caching the parsed
# render list does not avoid the rasterization. It also allocates from INTERNAL
# RAM, not PSRAM: CMakeLists forces LV_USE_STDLIB_MALLOC=LV_STDLIB_CLIB, and
# CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384 keeps the decoder's many small nodes
# internal. A 4 MB budget against ~400 KB of free internal RAM is a latent OOM.

# --- Rendering performance (step 2: PPA draw unit) ---
# LVGL 9.5 ships an Espressif PPA draw unit that runs rect fills and RGB565
# image blits on the P4's Pixel Processing Accelerator instead of the CPU. It
# hard-requires LV_DRAW_BUF_ALIGN == CONFIG_CACHE_L2_CACHE_LINE_SIZE (128).
# That is only safe now that the draw buffers ARE the DPI panel's frame buffers,
# which the driver allocates cache-line aligned; the previous attempt used
# espp's heap_caps_malloc buffers (4/8-byte aligned) and boot-looped on the
# "buf1 is not aligned" assert in lv_display_set_buffers.
CONFIG_LV_DRAW_BUF_ALIGN=128
# LV_USE_PPA is OFF. Its draw unit only ever writes the cache BACK (C2M) and
# never invalidates (M2C) -- grep the ppa dir, there is no M2C anywhere. So after
# the PPA's DMA writes pixels, the CPU's cached copy of that region is stale, and
# refr_sync_areas' lv_draw_buf_copy then propagates those stale pixels into the
# other frame buffer. The two buffers drift apart and LVGL alternates between
# them every refresh -> the screen visibly blinks on a static image.
# It also ignores the `area` argument and msyncs the whole 1.8 MB frame buffer
# twice per PPA task (lv_draw_ppa_buf.c:42), which scales with task count rather
# than pixel count -- so it may well be a net slowdown here too.
# Re-enable only with an area-scoped C2M + M2C fix in the draw unit.
# CONFIG_LV_USE_PPA=y
# CONFIG_LV_USE_PPA_IMG=y
